package section_1;

/**
 * Написать программу которая выводит фамилию автора.
 **/
public class Chapter1Task1 {

    public static void main(String[] args) {
        String name = "Gajdaj Artem";
        System.out.print(name);
    }
}
